Netology1/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Netology1/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Netology1/src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Сообщить("Обработка проверки заполнения: " + КонтекстВыполненияКлиентСервер.ТекущийКонтекст());  
	
	ЭтоЮридическоеЛицо = (ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо")); 
	ЭтоФизическоеЛицо = (ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"));    
	ДлинаИНН = СтрДлина(ИНН);
	ДлинаКПП = СтрДлина(КПП);      
	ПараметрыИННКПП = "1234567890";
	
	Если ЭтоФизическоеЛицо И ДлинаИНН <> 12 Тогда
		Сообщить ("ИНН физического лица должен состоять из 12 символов");
		Отказ = Истина;
	КонецЕсли;
	
	Если ЭтоФизическоеЛицо И ЗначениеЗаполнено (КПП) Тогда
		Сообщить ("КПП физического лица должен быть пустым");
		Отказ = Истина;
	КонецЕсли;
	
	Если ЭтоЮридическоеЛицо И ДлинаИНН <> 10 тогда
		Сообщить ("ИНН юридического лица должен состоять из 10 символов");
		Отказ = Истина;
	КонецЕсли;
	
	Если ЭтоЮридическоеЛицо И ДлинаКПП <>9 тогда
		Сообщить ("КПП Юридического лица должно состоять из 9 символов");
		Отказ = Истина;
	КонецЕсли;
	
	Для Счетчик = 1 По ДлинаИНН Цикл 
		
		СимволИНН = Сред(ИНН,Счетчик, 1); 
		ПоискСимволаИНН = СтрНайти(ПараметрыИННКПП,СимволИНН); 
		
		Если Не ПоискСимволаИНН Тогда  
			Отказ = Истина;
			Сообщить("ИНН может состоять только из цифр");	
		КонецЕсли; 
		
	КонецЦикла;      
	
	Для Счетчик = 1 По ДлинаКПП Цикл 
		
		СимволКПП = Сред(КПП,Счетчик, 1); 
		ПоискСимволаКПП = СтрНайти(ПараметрыИННКПП,СимволКПП); 
		
		Если Не ПоискСимволаКПП Тогда  
			Отказ = Истина; 
			Сообщить("КПП может состоять только из цифр");			
		КонецЕсли; 
		
	КонецЦикла;      
	
	Если РаботаСИНН.ИННВерен(ИНН) = Ложь Тогда
		Отказ = Истина;
		Сообщить("Контрольная сумма ИНН не совпадает, проверьте правильность ввода");
	КонецЕсли;

КонецПроцедуры       

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
КонецПроцедуры
